[{"id":"1","name":"Blind Tiger","description":"With a “knack for romantic tension and page-turning suspense, this one is a winner.” The year 1920 comes in with a roar in this rousing and suspenseful novel by #1 New York Times bestselling author Sandra Brown. Prohibition is the new law of the land, but murder, mayhem, lust, and greed are already institutions in the Moonshine Capitol of Texas (Booklist, starred review).Thatcher Hutton, a war-weary soldier on the way back to his cowboy life, jumps from a moving freight train to avoid trouble . . . and lands in more than he bargained for. On the day he arrives in Foley, Texas, a local woman goes missing. Thatcher, the only stranger in town, is suspected of her abduction, and worse. Standing between him and exoneration are a corrupt mayor, a crooked sheriff, a notorious cathouse madam, a sly bootlegger, feuding moonshiners . . . and a young widow whose soft features conceal an iron will.What was supposed to be a fresh start for Laurel Plummer turns to tragedy. Left destitute but determined to dictate her own future, Laurel plunges into the lucrative regional industry, much to the dislike of the good ol’ boys, who have ruled supreme. Her success quickly makes her a target for cutthroat competitors, whose only code of law is reprisal. As violence erupts, Laurel and—now deputy—Thatcher find themselves on opposite sides of a moonshine war, where blood flows as freely as whiskey.","price":19.99},{"id":"2","name":"The Old Farmer's Almanac 2022 ","description":"Happy New Almanac Year! It’s time to celebrate the 230th edition of The Old Farmer’s Almanac! Long recognized as North America’s most-beloved and best-selling annual, this handy yellow book fulfills every need and expectation as a calendar of the heavens, a time capsule of the year, an essential reference that reads like a magazine. Always timely, topical, and distinctively “useful, with a pleasant degree of humor,” the Almanac is consulted daily throughout the year by users from all walks of life.The 2022 edition contains the fun facts, predictions, and feature items that have made it a cultural icon: traditionally 80 percent–accurate weather forecasts; notable astronomical events and time-honored astrological dates; horticultural, culinary, fashion, and other trends; historical hallmarks; best fishing days; time- and money-saving garden advice; recipes for delicious dishes; facts on folklore, farmers, home remedies, and husbandry; amusements and contests; plus too much more to mention—all in the inimitable Almanac style that has charmed and educated readers since 1792.","price":9.99},{"id":"3","name":"Once There Were Wolves ","description":"rom the author of the beloved national bestseller Migrations, a pulse-pounding new novel set in the wild Scottish Highlands.Inti Flynn arrives in Scotland with her twin sister, Aggie, to lead a team of biologists tasked with reintroducing fourteen gray wolves into the remote Highlands. She hopes to heal not only the dying landscape, but Aggie, too, unmade by the terrible secrets that drove the sisters out of Alaska.Inti is not the woman she once was, either, changed by the harm she’s witnessed―inflicted by humans on both the wild and each other. Yet as the wolves surprise everyone by thriving, Inti begins to let her guard down, even opening herself up to the possibility of love. But when a farmer is found dead, Inti knows where the town will lay blame. Unable to accept her wolves could be responsible, Inti makes a reckless decision to protect them. But if the wolves didn’t make the kill, then who did? And what will Inti do when the man she is falling for seems to be the prime suspect?Propulsive and spell-binding, Charlotte McConaghy's Once There Were Wolves is the unforgettable story of a woman desperate to save the creatures she loves―if she isn’t consumed by a wild that was once her refuge.","price":22.99},{"id":"4","name":"Agatha of Little Neon","description":"Claire Luchette's debut, Agatha of Little Neon, is a novel about yearning and sisterhood, figuring out how you fit in (or don’t), and the unexpected friends who help you find your truest selfAgatha has lived every day of the last nine years with her sisters: they work together, laugh together, pray together. Their world is contained within the little house they share. The four of them are devoted to Mother Roberta and to their quiet, purposeful life.But when the parish goes broke, the sisters are forced to move. They land in Woonsocket, a former mill town now dotted with wind turbines. They take over the care of a halfway house, where they live alongside their charges, such as the jawless Tim Gary and the headstrong Lawnmower Jill. Agatha is forced to venture out into the world alone to teach math at a local all-girls high school, where for the first time in years she has to reckon all on her own with what she sees and feels. Who will she be if she isn’t with her sisters? These women, the church, have been her home. Or has she just been hiding?Disarming, delightfully deadpan, and full of searching, Claire Luchette’s Agatha of Little Neon offers a view into the lives of women and the choices they make.","price":15.99},{"id":"5","name":"Sir Gawain and the Green Knight, Pearl, and Sir Orfeo","description":"THREE MEDIEVAL ENGLISH POEMS, WITH TRANSLATION AND COMMENTARY BY J.R.R. TOLKIENIt’s Christmas at Camelot and King Arthur won’t begin to feast until he has witnessed a marvel of chivalry. A mysterious knight, green from head to toe, rides in and brings the court’s wait to an end with an implausible challenge to the Round Table: he will allow any of the knights to strike him once, with a battle-axe no less, on the condition that he is allowed to return the blow a year hence. Arthur’s brave favorite for the challenge is Sir Gawain…Accompanying Sir Gawain and the Green Knight in this book are Sir Orfeo, a medieval version of the story of Orpheus and Euridice, a love so strong that it overcame death, and Pearl, the moving tale of a man in a graveyard mourning his baby daughter, lost like a pearl that slipped through his fingers. Worn out by grief, he falls asleep and dreams of meeting her in a bejewelled fantasy world.Interpreted in a form designed to appeal to the general reader, J.R.R. Tolkien’s vivid translations of these classic poems represent the complete rhyme and alliterative schemes of the originals. This beautifully decorated text includes as a bonus the complete text of Tolkien’s acclaimed lecture on Sir Gawain.","price":2333},{"id":"9d6c2a87-ca82-4aef-8e9a-6baf790a14c6","name":"Publication Manual of the American Psychological Association","description":"A WALL STREET JOURNAL BESTSELLER - The new 2020 copyright release of the Publication Manual of the American Psychological Association, Seventh Edition includes three different formats — spiral and tabbed, paperback, and hardcover, all of which are full-color. It is the official source for APA Style. With millions of copies sold worldwide in multiple languages, it is the style manual of choice for writers, researchers, editors, students, and educators in the social and behavioral sciences, natural sciences, nursing, communications, education, business, engineering, and other fields.","price":23.3},{"id":"97e9f76d-015f-476a-a45a-a26223bd8200","name":"Concise Guide to APA Style","description":"Concise Guide to APA Style, Seventh Edition is the official APA Style resource for students. Designed specifically for undergraduate writing, this easy-to-use pocket guide is adapted from the seventh edition of the Publication Manual of the American Psychological Association. It provides complete guidance for new writers on effective, clear, and inclusive scholarly communication and the essentials of formatting papers and other course assignments.","price":23.3}]